src/Catalogs/СкладскиеЯчейки/СкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="45fc64e2-aecd-481a-bcbe-307fcba05f97">
  <name>СкладскиеЯчейки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes extendedConfigurationObject="a5ca5828-4e29-461b-885b-7139ab2b8f0d">
    <name>Стеллаж</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea064545-91fd-46da-987c-a068e1b5f13f">
    <name>Ярус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c4e170cc-c732-4607-8975-9c5a1ff87d55">
    <name>Линия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>дкл_КоординатаХНижнегоКрая</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>дкл_КоординатаУНижнегоКрая</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>дкл_Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>дкл_Глубина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/дкл_СкладскиеЯчейки/дкл_СкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_СкладскиеЯчейки</name>
  <resources>
    <name>storageId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>trayNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>itemId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>poseX</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>poseY</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>width</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>depth</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.дкл_Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладскаяЯчейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СкладскиеЯчейки/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура дкл_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая()	Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_СкладскиеЯчейки.poseX КАК poseX,
		|	дкл_СкладскиеЯчейки.poseY КАК poseY,
		|	дкл_СкладскиеЯчейки.width КАК width,
		|	дкл_СкладскиеЯчейки.depth КАК depth,
		|	дкл_СкладскиеЯчейки.barcode КАК barcode,
		|	дкл_СкладскиеЯчейки.trayNumber КАК trayNumber
		|ИЗ
		|	РегистрСведений.дкл_СкладскиеЯчейки КАК дкл_СкладскиеЯчейки
		|ГДЕ
		|	дкл_СкладскиеЯчейки.СкладскаяЯчейка = &СкладскаяЯчейка";
	
	Запрос.УстановитьПараметр("СкладскаяЯчейка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	НовыйЭлемент = Элементы.Вставить("ГруппаКоординатыРасположенияВАСХ",
		Тип("ГруппаФормы"),Неопределено,Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок = "Координаты расположения в АСХ";
	НовыйЭлемент.Подсказка = "Группа координаты расположения в АСХ ДиКоМ";

	НовыйЭлемент = Элементы.Вставить("poseX",Тип("ДекорацияФормы"),
		Элементы.ГруппаКоординатыРасположенияВАСХ,Неопределено);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = 
		"Точка нахождения по оси X: " + ?(ЗначениеЗаполнено(Выборка.poseX), Выборка.poseX, "-");

	НовыйЭлемент = Элементы.Вставить("poseY",Тип("ДекорацияФормы"),
		Элементы.ГруппаКоординатыРасположенияВАСХ,Неопределено);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = 
		"Точка нахождения по оси Y: " + ?(ЗначениеЗаполнено(Выборка.poseY), Выборка.poseY, "-");
	
	НовыйЭлемент = Элементы.Вставить("width",Тип("ДекорацияФормы"),
		Элементы.ГруппаКоординатыРасположенияВАСХ,Неопределено);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = 
		"Ширина: " + ?(ЗначениеЗаполнено(Выборка.width), Выборка.width, "-");

	НовыйЭлемент = Элементы.Вставить("depth",Тип("ДекорацияФормы"),
		Элементы.ГруппаКоординатыРасположенияВАСХ,Неопределено);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = 
		"Глубина: " + ?(ЗначениеЗаполнено(Выборка.depth), Выборка.depth, "-");

КонецПроцедуры                     

#КонецОбласти
